In [122]:
import pandas as pd 
import pathlib as Path
import matplotlib.pyplot as plt

In [123]:
df = pd.read_excel("Sales DataAi engineering.xlsx")

exploratory Data Analyis

In [124]:
df.head(3)

,Sales Person,Geography,Product,Date,Amount,Boxes
0,Barr Faughny,New Zealand,Raspberry Choco,2021-01-01,8414,495
1,Dennison Crosswaite,Canada,White Choc,2021-01-01,532,54
2,Karlen McCaffrey,USA,99% Dark & Pure,2021-01-01,5376,269

In [125]:
df.isna().sum()

Sales Person    0
Geography       0
Product         0
Date            0
Amount          0
Boxes           0
dtype: int64

In [126]:
df.dtypes

Sales Person            object
Geography               object
Product                 object
Date            datetime64[ns]
Amount                   int64
Boxes                    int64
dtype: object

In [127]:
df.shape
df.tail()

,Sales Person,Geography,Product,Date,Amount,Boxes
3786,Van Tuxwell,India,Drinking Coco,2022-01-19,10682,1526
3787,Rafaelita Blaksland,Australia,Mint Chip Choco,2022-01-18,11746,511
3788,Kelci Walkden,Australia,Spicy Special Slims,2022-01-03,8862,1477
3789,Gunar Cockshoot,New Zealand,Mint Chip Choco,2022-01-21,11592,527
3790,Mallorie Waber,USA,Spicy Special Slims,2022-01-07,3871,431

In [128]:
df.loc[[0,2,3,8]]

,Sales Person,Geography,Product,Date,Amount,Boxes
0,Barr Faughny,New Zealand,Raspberry Choco,2021-01-01,8414,495
2,Karlen McCaffrey,USA,99% Dark & Pure,2021-01-01,5376,269
3,Barr Faughny,New Zealand,Baker's Choco Chips,2021-01-01,259,22
8,Brien Boise,Australia,Caramel Stuffed Bars,2021-01-01,4039,176

In [129]:
df.iloc[[0,2,3,8]]

,Sales Person,Geography,Product,Date,Amount,Boxes
0,Barr Faughny,New Zealand,Raspberry Choco,2021-01-01,8414,495
2,Karlen McCaffrey,USA,99% Dark & Pure,2021-01-01,5376,269
3,Barr Faughny,New Zealand,Baker's Choco Chips,2021-01-01,259,22
8,Brien Boise,Australia,Caramel Stuffed Bars,2021-01-01,4039,176

In [130]:
df.loc[[1,33,5,7],['Sales Person','Product','Amount']]

           Sales Person              Product  Amount
1   Dennison Crosswaite           White Choc     532
33  Rafaelita Blaksland        85% Dark Bars    9730
5   Rafaelita Blaksland        85% Dark Bars    2184
7        Dotty Strutley  Organic Choco Syrup    1036

In [131]:
df.iloc[[1,33,5,7],[0,2,4]]

           Sales Person              Product  Amount
1   Dennison Crosswaite           White Choc     532
33  Rafaelita Blaksland        85% Dark Bars    9730
5   Rafaelita Blaksland        85% Dark Bars    2184
7        Dotty Strutley  Organic Choco Syrup    1036

In [132]:
df.iloc[:,:]

,Sales Person,Geography,Product,Date,Amount,Boxes
0,Barr Faughny,New Zealand,Raspberry Choco,2021-01-01,8414,495
1,Dennison Crosswaite,Canada,White Choc,2021-01-01,532,54
2,Karlen McCaffrey,USA,99% Dark & Pure,2021-01-01,5376,269
3,Barr Faughny,New Zealand,Baker's Choco Chips,2021-01-01,259,22
4,Beverie Moffet,USA,Manuka Honey Choco,2021-01-01,5530,179
...,...,...,...,...,...,...
3786,Van Tuxwell,India,Drinking Coco,2022-01-19,10682,1526
3787,Rafaelita Blaksland,Australia,Mint Chip Choco,2022-01-18,11746,511
3788,Kelci Walkden,Australia,Spicy Special Slims,2022-01-03,8862,1477
3789,Gunar Cockshoot,New Zealand,Mint Chip Choco,2022-01-21,11592,527
3790,Mallorie Waber,USA,Spicy Special Slims,2022-01-07,3871,431

In [133]:
df.loc[-1:]

,Sales Person,Geography,Product,Date,Amount,Boxes
0,Barr Faughny,New Zealand,Raspberry Choco,2021-01-01,8414,495
1,Dennison Crosswaite,Canada,White Choc,2021-01-01,532,54
2,Karlen McCaffrey,USA,99% Dark & Pure,2021-01-01,5376,269
3,Barr Faughny,New Zealand,Baker's Choco Chips,2021-01-01,259,22
4,Beverie Moffet,USA,Manuka Honey Choco,2021-01-01,5530,179
...,...,...,...,...,...,...
3786,Van Tuxwell,India,Drinking Coco,2022-01-19,10682,1526
3787,Rafaelita Blaksland,Australia,Mint Chip Choco,2022-01-18,11746,511
3788,Kelci Walkden,Australia,Spicy Special Slims,2022-01-03,8862,1477
3789,Gunar Cockshoot,New Zealand,Mint Chip Choco,2022-01-21,11592,527
3790,Mallorie Waber,USA,Spicy Special Slims,2022-01-07,3871,431

In [134]:
df.loc[0:4,'Sales Person':'Product']# Pick from row 0 to 4, and column 1 to 3...

          Sales Person      Geography              Product
0         Barr Faughny    New Zealand      Raspberry Choco
1  Dennison Crosswaite         Canada           White Choc
2     Karlen McCaffrey            USA      99% Dark & Pure
3         Barr Faughny    New Zealand  Baker's Choco Chips
4       Beverie Moffet            USA   Manuka Honey Choco

In [135]:
df.iloc[0:4,0:4]

          Sales Person      Geography              Product       Date
0         Barr Faughny    New Zealand      Raspberry Choco 2021-01-01
1  Dennison Crosswaite         Canada           White Choc 2021-01-01
2     Karlen McCaffrey            USA      99% Dark & Pure 2021-01-01
3         Barr Faughny    New Zealand  Baker's Choco Chips 2021-01-01

In [136]:
df.iloc[0:,1:4]

          Geography              Product       Date
0       New Zealand      Raspberry Choco 2021-01-01
1            Canada           White Choc 2021-01-01
2               USA      99% Dark & Pure 2021-01-01
3       New Zealand  Baker's Choco Chips 2021-01-01
4               USA   Manuka Honey Choco 2021-01-01
...             ...                  ...        ...
3786         India         Drinking Coco 2022-01-19
3787     Australia       Mint Chip Choco 2022-01-18
3788     Australia   Spicy Special Slims 2022-01-03
3789   New Zealand       Mint Chip Choco 2022-01-21
3790         USA     Spicy Special Slims 2022-01-07

[3791 rows x 3 columns]

In [137]:
df = df.applymap(lambda x :x.strip() if isinstance(x,str) else x)

C:\Users\User\AppData\Local\Temp\ipykernel_18240\537139012.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df = df.applymap(lambda x :x.strip() if isinstance(x,str) else x)

In [138]:
df["Geography"].unique()

array(['New Zealand', 'Canada', 'USA', 'India', 'UK', 'Australia'],
      dtype=object)

In [139]:
df.set_index("Geography",inplace=True)
df.head()

,Sales Person,Product,Date,Amount,Boxes
Geography,,,,,
New Zealand,Barr Faughny,Raspberry Choco,2021-01-01,8414,495
Canada,Dennison Crosswaite,White Choc,2021-01-01,532,54
USA,Karlen McCaffrey,99% Dark & Pure,2021-01-01,5376,269
New Zealand,Barr Faughny,Baker's Choco Chips,2021-01-01,259,22
USA,Beverie Moffet,Manuka Honey Choco,2021-01-01,5530,179

In [140]:
df.index.unique()

Index(['New Zealand', 'Canada', 'USA', 'India', 'UK', 'Australia'], dtype='object', name='Geography')